---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarHostData.GetRebarsInHost
source: html/be275d81-a411-f199-79bc-0cd21af8c645.htm
---
# Autodesk.Revit.DB.Structure.RebarHostData.GetRebarsInHost Method

Returns all Rebar elements hosted by the referenced element.

## Syntax (C#)
```csharp
public IList<Rebar> GetRebarsInHost()
```